cbs transfer.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fcub="http://fcubs.ofss.com/service/FCUBSRTService">
   <soapenv:Header/>
   <soapenv:Body>
      <fcub:REVERSETRANSACTION_IOPK_REQ>
         <fcub:FCUBS_HEADER>
            <fcub:SOURCE>?</fcub:SOURCE>
            <fcub:UBSCOMP>?</fcub:UBSCOMP>
            <!--Optional:-->
            <fcub:MSGID>?</fcub:MSGID>
            <!--Optional:-->
            <fcub:CORRELID>?</fcub:CORRELID>
            <fcub:USERID>?</fcub:USERID>
            <fcub:BRANCH>?</fcub:BRANCH>
            <!--Optional:-->
            <fcub:MODULEID>?</fcub:MODULEID>
            <fcub:SERVICE>?</fcub:SERVICE>
            <fcub:OPERATION>?</fcub:OPERATION>
            <!--Optional:-->
            <fcub:SOURCE_OPERATION>?</fcub:SOURCE_OPERATION>
            <!--Optional:-->
            <fcub:SOURCE_USERID>?</fcub:SOURCE_USERID>
            <!--Optional:-->
            <fcub:DESTINATION>?</fcub:DESTINATION>
            <!--Optional:-->
            <fcub:MULTITRIPID>?</fcub:MULTITRIPID>
            <!--Optional:-->
            <fcub:FUNCTIONID>?</fcub:FUNCTIONID>
            <!--Optional:-->
            <fcub:ACTION>?</fcub:ACTION>
            <!--Optional:-->
            <fcub:MSGSTAT>?</fcub:MSGSTAT>
            <!--Optional:-->
            <fcub:PASSWORD>?</fcub:PASSWORD>
            <!--Optional:-->
            <fcub:ADDL>
               <!--Zero or more repetitions:-->
               <fcub:PARAM>
                  <fcub:NAME>?</fcub:NAME>
                  <fcub:VALUE>?</fcub:VALUE>
               </fcub:PARAM>
            </fcub:ADDL>
         </fcub:FCUBS_HEADER>
         <fcub:FCUBS_BODY>
            <fcub:Transaction-Details-IO>
               <!--Optional:-->
               <fcub:XREF>?</fcub:XREF>
               <!--Optional:-->
               <fcub:FCCREF>?</fcub:FCCREF>
            </fcub:Transaction-Details-IO>
         </fcub:FCUBS_BODY>
      </fcub:REVERSETRANSACTION_IOPK_REQ>
   </soapenv:Body>
</soapenv:Envelope>